app/controllers/microposts_controller.rb

INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('asdijbasjidjoasdjasjdbjaisdbjiasbdijbasidjbasijdbijasdijabsdijbasijdbaijsbdijasbdijbasijdbasijdbijasbdijabsidjbasijdbasdasd', 1, '2016-06-29 12:34:38', '2016-06-29 12:34:38')
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save