app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = User.paginate(page: params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('asd', 'asd@asd', '2016-06-29 12:29:28', '2016-06-29 12:29:28')
---
  def create
    @user = User.new(user_params)
    if @user.save